// // Напишите программу, которая будет принимать на вход два числа и выводить, 
// // является ли второе число кратным первому. Если число 2 не кратно числу 1, то программа выводит остаток от деления.
// // 34, 5 -> не кратно, остаток 4 
// // 16, 4 -> кратно








// if ((numbers % numbers) == 0)
// {

// }

// else
// {
// (numbers%numbers)
// }










// Напишите программу, которая принимает на вход число и проверяет,
//  кратно ли оно одновременно 7 и 23.
// 14 -> нет 
// 46 -> нет 
// 161 -> да
